<!-- dflook/terraform-github-actions {"workspace":"tf-cloud-1-6","backend_type":"remote","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","backend":"d875d142a5fb3ebcec45366b25f4590d1e8ace5ca355fbb4ba2ec2cec45e27f7","plan_job_ref":"Job Test plan target and replace #417 at https://github.com/dflook/terraform-github-actions/actions/runs/7861716235","plan_hash":"cce1822c5417f8d423c2f3263490356806327a68c3c9c536c7ab0856398c43fe","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __tf-cloud-1-6__ workspace
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] must be replaced
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      length      = 10 -> 6 # forces replacement
!~      result      = "**********" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  foreach = "O1ApY7TBDW" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #417](https://github.com/dflook/terraform-github-actions/actions/runs/7861716235)